KOR-Gunhee/nordic_nrf52810_ble/main.c
uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

/********************************************************
*	BMT „ë¡œíŠ¸ì„œ ¬ìš©˜ëŠ” êµ¬ë¬¸€ „ëž˜ì¶”êœë‹¤.	*
********************************************************/


uint8_t bmt_state = BMT_STATE_LOW_POWER;

uint32_t tx_enable_local_time;
uint32_t tx_enable_device_info;
uint32_t tx_enable_ack_current_time;
uint32_t tx_enable_exec_time;
uint32_t tx_enable_exec_time_again;
uint32_t tx_enable_exec_time_call;
uint32_t tx_enable_sensor_info = true;

uint8_t test_conn_flag=0;
uint8_t bsp_flag;
uint8_t *Local_Time;
uint8_t key_state;

uint8_t test_power=1;

void BMT_system_low_power_enter(void);
void BMT_local_time_save(void);
void BMT_local_time_restore(void);
void BMT_execute_cmd(uint8_t p_data);
static void BMT_advertising_start(void);


enum EmType{
	 ENUM_CMD_MOTOR_START         = 's'
	,ENUM_CMD_MOTOR_STOP          = 'p'
	,ENUM_CMD_MOTOR_POWER0        = '0'
        ,ENUM_CMD_MOTOR_POWER1        = '1'
        ,ENUM_CMD_MOTOR_POWER2        = '2'
        ,ENUM_CMD_MOTOR_POWER3        = '3'
        ,ENUM_CMD_MOTOR_POWER4        = '4'
        ,ENUM_CMD_MOTOR_POWER5        = '5'
        ,ENUM_CMD_MOTOR_POWER6        = '6'
	,ENUM_CMD_MOTOR_POWER_SELECT  = 'm'
	,ENUM_CMD_DEVICE_INFO         = 'g'
	,ENUM_CMD_DFU_START           = 'f'
        ,ENUM_CMD_BLE_DISCONN         = 'q'
        ,ENUM_CMD_LOCAL_TIME          = 'l'
        ,ENUM_CMD_GLOBAL_TIME         = 'c'
        ,ENUM_CMD_EXEC_TIME_CALL      = 'e'
        ,ENUM_CMD_EXEC_TIME           = 'a'
        ,ENUM_CMD_EXEC_TIME_AGAIN     = 'n'
        ,ENUM_CMD_LED_CONTROL         = 'd'
        ,ENUM_CMD_TEST1               = '['
        ,ENUM_CMD_TEST2               = ']'
        ,ENUM_CMD_TEST3               = '/'
};
      
      
void ble_send_data(uint8_t *buf, uint16_t len){

    ret_code_t err_code = ble_nus_data_send(&m_nus, buf, &len, m_conn_handle);
    if ((err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_NOT_FOUND))
    {
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;
        
        NRF_LOG_INFO("-------Get cmd Loacl Time----------");
        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            if (nrf_uart_buff.Tail>=NRF_SZ_UART_BUFF){nrf_uart_buff.Tail=0;}
            nrf_uart_buff.Buff[nrf_uart_buff.Tail++]=p_evt->params.rx_data.p_data[i];
            
            if (p_evt->params.rx_data.p_data[i]==0x63){break;}
            NRF_LOG_INFO("Local_Time[%d] = 0x%X", i ,p_evt->params.rx_data.p_data[i]);
        }    
        NRF_LOG_INFO("-------------------------------------");
        Local_Time = p_evt->params.rx_data.p_data;
    }
}

/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

