KOR-Gunhee/nordic_nrf52810_ble/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION; 
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
} 


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);
    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

uint8_t BMT_calc_checksum(uint8_t *data, uint32_t len)
{
    uint8_t checksum;
	
    checksum = 0xFF;
    
//    NRF_LOG_INFO("p_data : ");
    
    for(uint32_t i = 0; i < len; i++) {
	checksum += data[i];
        
//        NRF_LOG_INFO("%d, ", data[i]);
    }
    return ~checksum;
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}
  
/**@brief Function for starting advertising.
 */
static void BMT_advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

void BMT_start_dfu(void)
{
    uint32_t err_code;
    uint32_t read_data1;
    uint32_t read_data2;


    err_code = sd_power_gpregret_get(0, &read_data1);
    APP_ERROR_CHECK(err_code);

    err_code = sd_power_gpregret_clr(0, 0xff);
    APP_ERROR_CHECK(err_code);

    err_code = sd_power_gpregret_set(0, 0xB1);
    APP_ERROR_CHECK(err_code);

    err_code = sd_power_gpregret_get(0, &read_data2);
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    sd_nvic_SystemReset();
}

void BMT_execute_cmd(uint8_t p_data)
{
	uint32_t err_code;
	bmt_time_t current_time;
      
        NRF_LOG_INFO("Byte Cmd");
        //NRF_LOG_INFO("Recv : 0x%02X", p_data);

	if(p_data == 's') {		// Start Vibration
		NRF_LOG_INFO("### Motor Start (%d) ### \r\n", vibration_power_index);
                vibration_power_index = get_vibration_power();
		motor_start(vibration_power[vibration_power_index]);
		timer_stop_30sec();
	}
	else if(p_data == 'p') {	// Pause
                NRF_LOG_INFO("### Pause Vibration ### \r\n");
		motor_stop();
		timer_start_30sec();
	}
	else if((p_data >= '0') && (p_data <= '6')) {	// Vibration
		if(vibration_power_index != (p_data - 0x30)) {
                    NRF_LOG_INFO("Vibration update (%d -> %d) \r\n", vibration_power_index, (p_data - 0x30));
                    motor_stop();
                    vibration_power_index = (p_data - 0x30);
                    flash_update_flag = FLASH_UPDATE_FLAG_VIBRATION_POWER;
		}
	}
	else if(p_data == 'g') {	// Get Device Info
		tx_enable_device_info = true;
	}
	else if(p_data == 'f') {	// Firmware update by DFU
		BMT_start_dfu();
	}
	else if(p_data == 'q') {	// Disconnect
		err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		APP_ERROR_CHECK(err_code);
                sd_nvic_SystemReset();
	}
	//else if(p_data == 'l') {	// Tx Local Time
	//	tx_enable_local_time = true;
	//}
	//else if(p_data == 'c') {	// Update Current time
 //               NRF_LOG_INFO("### Update Current time ###\r\n");
              
	//	// Checksum ê²€
	//	if(Local_Time[8] == BMT_calc_checksum(Local_Time,8)) {
	//		current_time.year = (Local_Time[1] << 8) | Local_Time[2];
	//		current_time.mon = Local_Time[3];
	//		current_time.day = Local_Time[4];
	//		current_time.hour = Local_Time[5];
	//		current_time.min = Local_Time[6];
	//		current_time.sec = Local_Time[7];
			
	//		// Update Local Time
	//		bmt_set_time(current_time);
			
	//		tx_enable_ack_current_time = true;
	//	}
	//	else {
 //                       NRF_LOG_INFO("### Checksum Error!!! ###\r\n");
	//	}
		
	//}
	//else if(p_data == 'a') {	// ack ˜ì‹  ´í›„   exec_time ˜ë‚˜„ì†¡
	//	if(exec_time_count() != 0) {
 //                   tx_enable_exec_time = true;
	//	}
 //               else {
 //                   NRF_LOG_INFO("exec time non-count");
 //               }
	//}
	//else if(p_data == 'n') {	// nack
	//	tx_enable_exec_time_again = true;
	//}          
        else {
              NRF_LOG_INFO("NULL");
	}
}
          
void BMT_packet_cmd()
{
    //NRF_LOG_INFO("data : 0x%02X", PacketData[0]);
    uint32_t err_code;
    uint8_t R_LED, G_LED, B_LED = 0;
    bmt_time_t current_time;
    
    NRF_LOG_INFO("Packet Cmd");
    
    switch(PacketData[0])
    {
      case ENUM_CMD_MOTOR_START:
        NRF_LOG_INFO("### Motor Start (%d) ### \r\n", vibration_power_index);
        vibration_power_index = get_vibration_power();
        motor_start(vibration_power[vibration_power_index]);
        timer_stop_30sec();
        break;
      
      case ENUM_CMD_MOTOR_STOP:
        NRF_LOG_INFO("### Pause Vibration ### \r\n");
        motor_stop();
        timer_start_30sec();
        break;
      
      case ENUM_CMD_MOTOR_POWER0:
      case ENUM_CMD_MOTOR_POWER1:
      case ENUM_CMD_MOTOR_POWER2:
      case ENUM_CMD_MOTOR_POWER3:
      case ENUM_CMD_MOTOR_POWER4:
      case ENUM_CMD_MOTOR_POWER5:
      case ENUM_CMD_MOTOR_POWER6:
        if(vibration_power_index != (PacketData[0] - 0x30)) {
          NRF_LOG_INFO("Vibration update (%d -> %d) \r\n", vibration_power_index, (PacketData[1] - 0x30));
          motor_stop();
          vibration_power_index = (PacketData[0] - 0x30);
          flash_update_flag = FLASH_UPDATE_FLAG_VIBRATION_POWER;
        }
        break;
      
      case ENUM_CMD_MOTOR_POWER_SELECT:
       
        
      break;
      
      case ENUM_CMD_DEVICE_INFO:
        tx_enable_device_info = true;
        break;
      
