KOR-Gunhee/nordic_nrf52810_ble/main.c
      case ENUM_CMD_DFU_START:
        BMT_start_dfu();
        break;
      
      case ENUM_CMD_BLE_DISCONN:
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
        sd_nvic_SystemReset();
        break;
      
      //case ENUM_CMD_LOCAL_TIME:
      //  tx_enable_local_time = true;
      //break;
      
      //case ENUM_CMD_GLOBAL_TIME:        
      //  NRF_LOG_INFO("-----Updata Current Loacl Time-----");
      //  NRF_LOG_INFO("PacketData[0] = 0x%X", PacketData[0]);
      //  NRF_LOG_INFO("PacketData[1] = 0x%X", PacketData[1]);
      //  NRF_LOG_INFO("PacketData[2] = 0x%X", PacketData[2]);
      //  NRF_LOG_INFO("PacketData[3] = 0x%X", PacketData[3]);
      //  NRF_LOG_INFO("PacketData[4] = 0x%X", PacketData[4]);
      //  NRF_LOG_INFO("PacketData[5] = 0x%X", PacketData[5]);
      //  NRF_LOG_INFO("PacketData[6] = 0x%X", PacketData[6]);
      //  NRF_LOG_INFO("PacketData[7] = 0x%X", PacketData[7]);
      //  NRF_LOG_INFO("PacketData[8] = 0x%X", PacketData[8]);
      //  NRF_LOG_INFO("-----------------------------------");
        
      //  // Checksum °Ë
      //  if(PacketData[8] == BMT_calc_checksum(PacketData,8)) {
      //  current_time.year = (PacketData[1] << 8) | PacketData[2];
      //  current_time.mon = PacketData[3];
      //  current_time.day = PacketData[4];
      //  current_time.hour = PacketData[5];
      //  current_time.min = PacketData[6];
      //  current_time.sec = PacketData[7];
        
      //  NRF_LOG_INFO("CURRENT TIME : %d-%d-%d %d:%02d:%02d \r\n",
      //  current_time.year, current_time.mon, current_time.day, current_time.hour, current_time.min, current_time.sec);
         
      //  // Update Local Time
      //  bmt_set_time(current_time);
        
      //  tx_enable_ack_current_time = true;
      //  }
      //      else {
      //      NRF_LOG_INFO("### Checksum Error!!! ###\r\n");
      //  }
      //break;
      
      //case ENUM_CMD_EXEC_TIME:
      //  if(exec_time_count() != 0) {
      //      tx_enable_exec_time = true;
      //  }
      //break;
      
      //case ENUM_CMD_EXEC_TIME_AGAIN:
      //  tx_enable_exec_time_again = true;
      //break;
      
      //case ENUM_CMD_EXEC_TIME_CALL:
      //  tx_enable_exec_time_call = true;
      //break;
      
      case ENUM_CMD_LED_CONTROL:
        NRF_LOG_INFO("### LED Control ###\r\n");
        new_led_control((PacketData[1]-0x30)*100, (PacketData[2]-0x30)*100, (PacketData[3]-0x30)*100);  
      break;
      
      //case ENUM_CMD_TEST1:
      //  NRF_LOG_INFO("### Test Function ###");
      //  exec_time = local_time;
      //  exec_time.dur = 0x80;
      //  exec_time_write_test();
      //break;
      
      //case ENUM_CMD_TEST2:
      //  tx_enable_ack_current_time = true;
      //break;
      
      //case ENUM_CMD_TEST3:
      //  exec_time_print(0);
      //break;  
      
      default:
      break;
    
   
    }
}
/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("sd_app_evt_wait \r\n");
}

typedef struct
{
	uint32_t	year : 6;
	uint32_t	mon  : 4;
	uint32_t	day  : 5;
	uint32_t	hour : 5;
	uint32_t	min  : 6;
	uint32_t	sec  : 6;
} date_time_32bit_t;

union _UNION_DATE_TIME_32BIT
{
	date_time_32bit_t union_struct_date_time_32bit;
	uint32_t  union_date_time_32bit;
};

void BMT_local_time_save(void)
{
	bmt_time_t temp_time;
	union _UNION_DATE_TIME_32BIT _date_time_32bit;

	temp_time = local_time;
	
	_date_time_32bit.union_struct_date_time_32bit.year = temp_time.year - 2018;
	_date_time_32bit.union_struct_date_time_32bit.mon  = temp_time.mon;
	_date_time_32bit.union_struct_date_time_32bit.day  = temp_time.day;
	_date_time_32bit.union_struct_date_time_32bit.hour = temp_time.hour;
	_date_time_32bit.union_struct_date_time_32bit.min  = temp_time.min;
	_date_time_32bit.union_struct_date_time_32bit.sec  = temp_time.sec;
	
	NRF_WDT->CRV = _date_time_32bit.union_date_time_32bit;
}

void BMT_local_time_restore(void)
{
	bmt_time_t temp_time = {2018, 1, 1, 0, 0, 0};
	union _UNION_DATE_TIME_32BIT _date_time_32bit;
    
	
	if(NRF_WDT->CRV != 0xFFFFFFFF) {
		_date_time_32bit.union_date_time_32bit = NRF_WDT->CRV;
		
		temp_time.year	= _date_time_32bit.union_struct_date_time_32bit.year + 2018;
		temp_time.mon	= _date_time_32bit.union_struct_date_time_32bit.mon;
		temp_time.day	= _date_time_32bit.union_struct_date_time_32bit.day;
		temp_time.hour	= _date_time_32bit.union_struct_date_time_32bit.hour;
		temp_time.min	= _date_time_32bit.union_struct_date_time_32bit.min;
		temp_time.sec	= _date_time_32bit.union_struct_date_time_32bit.sec;
	}
	
	bmt_set_time(temp_time);
    
        NRF_LOG_INFO("### RESTORE LOCAL TIME (WDT REG : 0x%08X)\r\n", NRF_WDT->CRV);
}

void peripheral_disable()
{
    new_pwm_uninit();
    sensor_sleep();
    //bmt_app_timer_stop();
}
      
void peripheral_init()
{
    saadc_init();
    flash_init();
    new_pwm_init();
    twi_init();
    sensor_init();	
}
  
void BMT_system_low_power_enter(void)
{
        NRF_LOG_INFO("### LOW POWER MODE START ###\r\n");

        peripheral_disable();
        
        motor_state=0;
        
	bmt_state = BMT_STATE_LOW_POWER;
}
 
/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
    uint8_t byte00;
    
    uint32_t err_code;
    
    bsp_flag=0;
    
    // Initialize.  
    NRF_LOG_INFO("SYSTEM RESET\r\n"); 
    
    log_init();
    
    timers_init();
    
    bmt_app_timer_init(); // ?¿ë?´Â ¸ðµç ???¸Ó?ÃÊ±â?´Ù.
    timer_start_1sec(); // RTC ±¸µ¿?ÇÑ 1?  TICK ??¸Ó·ûÀÛ?´Ù.+
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();

    gap_params_init();
    gatt_init();
    
    services_init();
    advertising_init();
    conn_params_init();

    peripheral_init();

    BMT_local_time_restore();
    BMT_system_low_power_enter();
    
    
    
    NRF_LOG_INFO("DEV INFO : 2022.3.10");
    // Enter main loop. 
    while (true)
    {
        idle_state_handle();
          
        if(bsp_flag==1)
        {       
          brush_movement(bsp_flag);         
          bsp_flag=0;
        }
        
        if(flash_flag == 0)
        {
          if(uart_getbyte(&byte00)>0)
          {
              if(Packet_OnByte(byte00)){
                  BMT_packet_cmd();
              }
          }
        }
          
        if(flash_update_flag != FLASH_UPDATE_FLAG_NONE) {
            flash_operation(); 
	}
    }
}
